=================
cite
=================
\cite{foo}
-----------------
(document
  (cite
    (cs)
    (group (begin_group) (name) (end_group))))

=================
cite with optional
=================
\cite[baz]{foo}
-----------------
(document
  (cite
    (cs)
    (brack_group (lbrack) (text) (rbrack))
    (group (begin_group) (name) (end_group))))

=================
nocite
=================
\nocite{*}
-----------------
(document
  (cite
    (cs)
    (group (begin_group) (name) (end_group))))

=================
citep*
=================
\citep*{foo}
-----------------
(document
  (cite
    (cs)
    (group (begin_group) (name) (end_group))))
