=====================
emph
=====================
foo\emph{bar}wibble
---------------------
(document
  (text)
  (emph (cs) (group (l) (text) (r)))
  (text))

=====================
emph with a comment before argument
=====================
foo\emph%baz
{bar}wibble
---------------------
(document
  (text)
  (emph
    (cs)
    (comment)
    (group (l) (text) (r)))
  (text))

=====================
textbf
=====================
foo\textbf{bar}wibble
---------------------
(document
  (text)
  (textbf (cs) (group (l) (text) (r)))
  (text))

=====================
textit
=====================
foo\textit{bar}wibble
---------------------
(document
  (text)
  (textit (cs) (group (l) (text) (r)))
  (text))

=====================
texttt
=====================
foo\texttt{bar}wibble
---------------------
(document
  (text)
  (texttt (cs) (group (l) (text) (r)))
  (text))
